Repository: kuma35/sed47doc-jp
Catalog: gnu-sed-doc-jp-level1.tmx
Source language: en_us
Languages: ja

source: #Multiline-techniques
ja: #Multiline-techniqu

source: $ seq 3 | sed ':x ; bx' # The above command requires gnu sed (which supports additional # commands following a label, without a newline).
ja: $ seq 3 | sed ':x ; bx' # 上記コマンド実行には gnu sed が必要です。 # （ラベル定義のあとで改行しないでいいのは gnu 拡張です。）

source: 1 Introduction
ja: 1 はじめに

source: 2 Running sed
ja: 2 sedの実行

source: 3 sed scripts
ja: 3 sedスクリプト

source: 3.1 sed script overview
ja: 3.1 sedスクリプト概要

source: 3.2 sed commands summary
ja: 3.2 sedコマンドまとめ

source: 5 Regular Expressions: selecting text
ja: 5 正規表現: テキストの選択

source: 6 Advanced sed: cycles and buffers
ja: 6 sedの高度な話題: サイクルとバッファ

source: 7 Some Sample Scripts
ja: 7 スクリプト例をいくつか

source: sed does not support a typical if/then construct.
ja: sedには典型的なif/then構文がありません。

source: sed maintains two data buffers: the active pattern space, and the auxiliary hold space.
ja: sedは2つのバッファを保持しています。それは現に活動中のパターンスペースと補助のホールドスペースです。

source: sed operates by performing the following cycle on each line of input: first, sed reads one line from the input stream, removes any trailing newline, and places it in the pattern space.
ja: sedは入力の各行ごとに以下のサイクルを実行します。最初にsedは入力ストリームから1行読み取り、末尾の改行を削除し、パターンスペースに入れます。

source: sed starts by reading the first line into the pattern space (i.e. ‘1’).
ja: sedは最初の1行をパターンスペースに読み込み（すなわちパターンスペースの内容は‘1’）

source: appends line from the hold space to the pattern space, with a newline before it.
ja: パターンスペースの末尾に改行を追加し更にホールドスペースから1行パターンスペースに追加します。

source: appends line from the input file to the pattern space.
ja: 1行追加。入力ストリームから1行パターンスペースに追加する。

source: appends line from the pattern space to the hold space, with a newline before it.
ja: ホールドスペースの末尾に改行を追加し更にパターンスペースから1行追加します。

source: deletes line from the pattern space until the first newline, and restarts the cycle.
ja: パターンスペースから最初の改行まで(改行含む)1行を削除する。パターンスペースのプリントや全削除をスキップして次のサイクルを開始する。

source: prints line from the pattern space until the first newline.
ja: パターンスペースの最初の改行(改行含む)までの1行をプリントする。

source: A common technique to process blocks of text such as paragraphs (instead of line-by-line) is using the following construct:
ja: （行ごとではなく）段落などのテキストブロックを処理するには以下のような構文を使用するのが一般的です。

source: A portable equivalent: # sed -e ':x' -e bx
ja: gnu sed 以外でも動くようにするには以下のようにします。 # sed -e ':x' -e bx

source: Addresses and regular expressions can be used as an if/then conditional: If [addr] matches the current pattern space, execute the command(s).
ja: アドレスや正規表現はif/then構文として使える。If パターンスペースの内容が[addr] に合致 then コマンド実行。

source: At the beginning of every cycle, the N command appends a newline and the next line to the pattern space (i.e. ‘1’, ‘\n’, ‘2’ in the first cycle).
ja: 毎度のサイクルを始めます。Nコマンドは(最初の1行をパターンスペースに読み込む時に取り除いた)改行を追加し、更に次の1行をパターンスペースに読み込みます( すなわちパターンスペースの内容は‘1’, ‘\n’, ‘2’ となる）。

source: At the next cycle the N command appends a newline and the next input line to the pattern space (e.g. ‘2’, ‘\n’, ‘3’).
ja: そのサイクルでNコマンドは同様に削除してあった改行追加し入力行をパターンスペースに追加します（すなわち、‘2’, ‘\n’, ‘3’).

source: Before reading the next input line, n prints the current pattern space then empties it, while N appends a newline and the next input line to the pattern space.
ja: nコマンドはパターンスペースの内容をプリントして、そしてパターンスペースの内容を全削除してから入力ストリームから次の1行を読み込みます。一方、 Nコマンドはひたすら改行と次の入力行をパターンスペースに追加していきます。

source: Both are initially empty.
ja: 両方とも最初は空です。

source: Both examples do not inf-loop, despite never starting a new cycle.
ja: 両例とも、決して新しいサイクルを始めることは無いにもかかわらず無限ループになりません。

source: Branching and Cycles
ja: 分岐とサイクル

source: Branching and Flow Control
ja: 分岐と制御構文

source: Branching example: joining lines
ja: 分岐例: 行連結

source: Branching is often complemented with the n or N commands: both commands read the next input line into the pattern space without waiting for the cycle to restart.
ja: 分岐はしばしばnコマンドやNコマンドと一緒に使われます。両コマンドは次のサイクルを開始することなしに入力ストリームから1行入力行をパターンスペースに入れます。

source: By default, sed reads an input line into the pattern buffer, then continues to processes all commands in order.
ja: デフォルトではsedは入力行をパターンスペースに読み込み、それから全てのコマンドを順番に実行します。

source: Centering Lines
ja: センタリング

source: Combined with an address, the branch can be conditionally executed on matched lines.
ja: 分岐はアドレスと組み合わせると、条件に適合した時だけジャンプさせることができます。

source: Command-Line Options
ja: コマンドラインオプション

source: Commands Specific to GNU sed
ja: GNU sed 固有のコマンド

source: Commands for sed gurus
ja: sed導師のためのコマンド群

source: Commands with addresses affect only matching lines.
ja: アドレス指定のあるコマンドはアドレス指定に合致する行に対してだけ実行されます。

source: Commands without addresses affect all lines.
ja: アドレス指定の無いコマンドは全ての行で実行されます。

source: Consider the following two examples:
ja: ここで以下の2つの例について考えてみます。

source: Exit status
ja: 終了ステータス

source: For example: The command /^#/d means: if the current pattern matches the regular expression ^# (a line starting with a hash), then execute the d command: delete the line without printing it, and restart the program cycle immediately.
ja: 例：/^#/d は、if パターンスペースが正規表現^#（行頭が#）に合致する then d コマンド実行（当該行を削除し、プリントせず、次のサイクルを開始する）。

source: For more annotated examples, see Text search across multiple lines and Line length adjustment.
ja: 注釈付きの例については、複数行にわたるテキスト検索や行の長さを揃えるを参照下さい。

source: Hold and Pattern Buffers
ja: ホールドとパターン用のバッファ

source: How sed Works
ja: sedはどのように動いているか

source: How sed works
ja: sedはどのように動いているか

source: If the label is omitted the branch commands restart the cycle.
ja: なお、ブランチコマンドでラベルを省略すると次のサイクルを開始します。

source: In the first example, the n commands first prints the content of the pattern space, empties the pattern space then reads the next input line.
ja: 最初の例ではnコマンドは最初にパターンスペースの内容をプリントし、それからパターンスペースの内容を全削除し、それから次の入力行を読み込みます。

source: In the second example, the N commands appends the next input line to the pattern space (with a newline).
ja: ２番目の例では、Nコマンドはひたすら次の行を（改行付きで）パターンスペースに追加していきます。

source: Instead, some commands can be used as conditionals or to change the default flow control:
ja: 代わりにいくつかのコマンドは、条件文や、制御の流れを変えるために使えます。

source: Joining lines
ja: 行連結

source: Labels are defined with a colon followed by one or more letters (e.g. ‘:x’).
ja: ラベルはコロン(:)に続く1文字またはそれ以上の文字列です（例えば‘:x’）。

source: Less Frequently-Used Commands
ja: あまり使われないコマンド群

source: Lines are accumulated in the pattern space until there are no more input lines to read, then the N command terminates the sed program.
ja: 入力ストリームからこれ以上入力行が読み込めなくなるまで入力行をパターンスペースに蓄積します。そしてNコマンドはsedを終了させます。

source: Multiline techniques - using D,G,H,N,P to process multiple lines
ja: 複数行テクニック - D,G,H,N,P コマンドで複数行処理

source: Multiple lines can be processed as one buffer using the D,G,H,N,P.
ja: 複数行は D,G,H,N,P コマンドを使って1つのバッファで処理できます。

source: Next: Hold and Pattern Buffers, Up: advanced sed [Contents][Index]
ja: 次: Hold and Pattern Buffers, Up: advanced sed [Contents][Index]

source: Note the difference between branching to a label and restarting the cycle: when a cycle is restarted, sed first prints the current content of the pattern space, then reads the next input line into the pattern space; Jumping to a label (even if it is at the beginning of the program) does not print the pattern space and does not read the next input line.
ja: ブランチコマンドによるジャンプと次のサイクルの開始との違いに注意して下さい。次のサイクルの開始時はsedはまずパターンスペースの内容をプリントして次に入力ストリームから1行パターンスペースに読み込みます。一方ラベルへのジャンプは（それがたとえプログラムの先頭へジャンプしたとしても）、パターンスペースの内容はプリントされませんし入力ストリームから次の1行を読み込む事もありません。

source: Often-Used Commands
ja: よく使われるコマンド群

source: On all lines except the last, the pattern space is deleted and the cycle is restarted.
ja: $!によって最終行以外ではパターンスペースの内容の全削除と残りの処理をスキップして次のサイクルを開始します。

source: On each cycle, the pattern space is printed and the next input line is read:
ja: よってどのサイクルでもパターンスペースの内容がプリントされて入力ストリームから次の入力行を読み取ります。

source: Overview
ja: 概要

source: Range Addresses
ja: 範囲アドレス

source: See Execution Cycle and Addresses overview.
ja: 実行サイクルとアドレス概要も参照下さい。

source: Selecting lines by numbers
ja: 数による行の選択

source: Table of Contents
ja: 目次

source: Table of contents
ja: 目次

source: The D command then removes the content of pattern space up to the first newline (leaving ‘2’ at the end of the first cycle).
ja: Dコマンドはパターンスペースの内容を最初の改行まで(その改行含む)削除し、そしてDパターンスペースの削除をスキップして次のサイクルを開始します （よって、次のサイクルは(2行目の)2’だけ状態から始まる）。

source: The b command (the only command in the program) does not have a label, and thus simply restarts the cycle.
ja: （このプログラム唯一のコマンドである）bコマンドは飛び先ラベルが書かれていないので次のサイクルを開始します。

source: The b command jumps to the ‘x’ label, and a new cycle is never started:
ja: bコマンドは‘x’ラベルにジャンプし、そして永遠に最初のサイクルにとどまり決して新しいサイクルが始まることはありません。

source: The b,t and T commands can be followed by a label (typically a single letter).
ja: bコマンドやtコマンドやTコマンドは、コマンドに続くジャンプ先ラベルが必要です（通常はアルファベット1文字）。

source: The l command prints the content of the pattern space unambiguously.
ja: lコマンドはパターンスペースの内容を非表示文字等含めて目に見える形でプリントします(削除はしない)。

source: The s Command
ja: s コマンド

source: The x command fetches the accumulated lines from the hold space back to the pattern space.
ja: xコマンドはパターンスペースの内容をホールドスペースの内容（累積した行）で置き換えます。

source: The s/// command then operates on all the text in the paragraph (including the embedded newlines).
ja: s///は（改行を含んだ）段落内の全てのテキストに対して実行されます 。

source: The y/// command is still executed on all lines:
ja: いずれにせよy///コマンドは全ての行で実行されます。

source: The branching commands b, t, and T enable changing the flow of sed programs.
ja: 分岐コマンドのbやtやTはsedプログラムの流れを変える事を可能にします。

source: The first (contrived) example uses the b command to skip the s/// command on lines containing ‘1’.
ja: 最初の（わざとらしい）例は‘1’を含む行の時にs///をスキップするためにbコマンドを使っています。

source: The first expression, /./{H;$!d} operates on all non-empty lines, and adds the current line (in the pattern space) to the hold space.
ja: スクリプト1行目の/./{H;$!d}は空行以外の全ての行に対して実行され、（パターンスペース内の) 現在行をホールドスペースに追加します。

source: The following example demonstrates this technique:
ja: 以下の例はこのテクニックのデモです。

source: The following example illustrates the operation of N and D commands:
ja: 次の例は、NコマンドやDコマンドの動作を示しています。

source: The following example is an infinite-loop - it doesn’t terminate and doesn’t print anything.
ja: 次のサンプルは無限ループに陥ります。一切プリントすることなく終了もしません（訳注：CTRL+C等で強制停止させる）。

source: The following program is a no-op.
ja: 以下のプログラム自身は何もしません。

source: The following two sed programs are equivalent.
ja: 以下の2つのsedプログラムは等価です。

source: The hold space, on the other hand, keeps its data between cycles (see commands ‘h’, ‘H’, ‘x’, ‘g’, ‘G’ to move data between both buffers).
ja: 一方ホールドスペースの内容はサイクル毎に削除しません。以降の新しいサイクルが始まっても内容を保持しています（両バッファの間でデータを移動させるためのコマンド、 ‘h’, ‘H’, ‘x’, ‘g’, ‘G’ も参照下さい）。

source: The other expressions x and s are executed only on empty lines (i.e. paragraph separators).
ja: 残りのスクリプトx と s は空行（すなわち段落の区切り）に対してだけ実行されます。

source: The second example uses an address with negation (‘!’) to perform substitution only on desired lines.
ja: 2番目の例ではアドレスの否定（ '！'）を使用して、目的の行のみs///コマンドを実行します。

source: Then commands are executed; each command can have an address associated to it: addresses are a kind of condition code, and a command is only executed if the condition is verified before the command is to be executed.
ja: 次にコマンド群を実行します。各コマンドはそのコマンドに関連付けられたアドレスを持つこともできます。アドレスは一種の条件コードで、条件に合致した時だけそのコマンドが実行されます。

source: They are similar to their lowercase counterparts (d,g, h,n,p), except that these commands append or subtract data while respecting embedded newlines - allowing adding and removing lines from the pattern and hold spaces.
ja: これらに対応する小文字の（d,g, h,n,p）は), except that these commands append or subtract data while respecting embedded newlines - allowing adding and removing lines from the pattern and hold spaces.

source: They operate as follows:
ja: これらのコマンドの動作は以下の通り。

source: Unless special commands (like ‘D’) are used, the pattern space is deleted between two cycles.
ja: （Dコマンドのような)特殊コマンドが使われてない限り、次のサイクルを開始する前にパターンスペースの内容を削除します。

source: Using D,G,H,N,P to process multiple lines
ja: D,G,H,N,P コマンドで複数行処理

source: When the end of the script is reached, unless the -n option is in use, the contents of pattern space are printed out to the output stream, adding back the trailing newline if it was removed.8 Then the next cycle starts for the next input line.
ja: スクリプトの最後まで到達した時(-nが指定されてなければ)、最初に一行読み込む時に削除した行末の改行を戻してから(読み込む時に行末の改行を削除してなかったらそのまま)、パターンスペースの内容を出力ストリームにプリントアウトします。8 それから次の入力行の為のサイクルを開始します。

source: When the program terminates, the end-of-cycle actions are performed, and the entire pattern space is printed.
ja: プログラムが終了する時はサイクル終了のアクションが実行されます。つまりパターンスペースの内容がプリントされます。

source: branch conditionally (that is: jump to a label) only if a s/// command has succeeded since the last input line was read or another conditional branch was taken.
ja: 条件分岐。最後に読み込まれた入力行のs///コマンドが成功し、かつ、まだ他の条件分岐が実行されてない場合に分岐実行する（指定のラベルへジャンプ)。

source: branch unconditionally (that is: always jump to a label, skipping or repeating other commands, without restarting a new cycle).
ja: 無条件分岐（指定のラベルへジャンプ。当該スクリプトの中で前にジャンプしてループを構成するのに使ったり、条件と組み合わせてelse部分をスキップするのに使える。あくまで当該スクリプトの中でジャンプするだけで当該サイクルを終了したり次のサイクルを開始することはない）

source: delete (clears) the current pattern space, and restart the program cycle without processing the rest of the commands and without printing the pattern space.
ja: パターンスペースの内容を全部クリアし、このコマンド以降のスクリプトの実行をスキップしてパターンスペースの内容をプリントせずに次のサイクルを開始する。

source: delete the contents of the pattern space up to the first newline, and restart the program cycle without processing the rest of the commands and without printing the pattern space.
ja: パターンスペースの最初の改行まで(その改行含む)削除し、このコマンド以降のスクリプトの実行をスキップしてパターンスペースの内容をプリントせずに次のサイクルを開始する。

source: sed, a stream editor
ja: ストリームエディタsed

source: similar but opposite to the t command: branch only if there has been no successful substitutions since the last input line was read.
ja: tコマンドと逆に、最後に読み込まれた入力行のs///コマンドが失敗した場合に分岐する。

source: • Branching and flow control:
ja: • 分岐と制御構文:

source: • Execution Cycle:
ja: • 実行サイクル:

source: • Hold and Pattern Buffers:
ja: • ホール用バッファとパターン用バッファ:

source: • Multiline techniques:
ja: • 複数行テクニック:
